work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-110-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=110 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 110

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140224
        write:                           0
        other:                           20032
        total:                           160256
    transactions:                        10016  (19674.65 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140224 (275445.06 per sec.)
    other operations:                    20032  (39349.29 per sec.)

Test execution summary:
    total time:                          0.5091s
    total number of events:              10016
    total time taken by event execution: 54.7513
    per-request statistics:
         min:                                  2.48ms
         avg:                                  5.47ms
         max:                                 16.94ms
         approx.  95 percentile:               6.95ms

Threads fairness:
    events (avg/stddev):           91.0545/10.76
    execution time (avg/stddev):   0.4977/0.00