work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-110-3
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=110 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 110

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140224
        write:                           0
        other:                           20032
        total:                           160256
    transactions:                        10016  (19787.38 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140224 (277023.33 per sec.)
    other operations:                    20032  (39574.76 per sec.)

Test execution summary:
    total time:                          0.5062s
    total number of events:              10016
    total time taken by event execution: 54.4883
    per-request statistics:
         min:                                  2.19ms
         avg:                                  5.44ms
         max:                                 14.84ms
         approx.  95 percentile:               6.72ms

Threads fairness:
    events (avg/stddev):           91.0545/8.15
    execution time (avg/stddev):   0.4953/0.00