work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-12-1
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=12 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 12

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140070
        write:                           0
        other:                           20010
        total:                           160080
    transactions:                        10005  (5587.31 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140070 (78222.32 per sec.)
    other operations:                    20010  (11174.62 per sec.)

Test execution summary:
    total time:                          1.7907s
    total number of events:              10005
    total time taken by event execution: 21.3875
    per-request statistics:
         min:                                  1.54ms
         avg:                                  2.14ms
         max:                                  4.69ms
         approx.  95 percentile:               3.01ms

Threads fairness:
    events (avg/stddev):           833.7500/132.53
    execution time (avg/stddev):   1.7823/0.00