work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-12-2
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=12 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 12

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140126
        write:                           0
        other:                           20018
        total:                           160144
    transactions:                        10009  (5896.39 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140126 (82549.40 per sec.)
    other operations:                    20018  (11792.77 per sec.)

Test execution summary:
    total time:                          1.6975s
    total number of events:              10009
    total time taken by event execution: 20.2777
    per-request statistics:
         min:                                  1.47ms
         avg:                                  2.03ms
         max:                                  3.27ms
         approx.  95 percentile:               2.65ms

Threads fairness:
    events (avg/stddev):           834.0833/132.15
    execution time (avg/stddev):   1.6898/0.00