work/log.ltccip8.2020-06-12_1807/sysbench-mariadb-oltp-ro-small/iter-0/sysbench/logs/sysbench-raw-141-1
sysbench --mysql-user=root --mysql-password=mmtests-default --mysql-db=sbtest --mysql-socket=/tmp/mysql.sock --mysql-table-engine=innodb --test=oltp --oltp-read-only --oltp-test-mode=complex --oltp-table-size=891000 --num-threads=141 run
sysbench 0.4.12:  multi-threaded system evaluation benchmark

No DB drivers specified, using mysql
Running the test with following options:
Number of threads: 141

Doing OLTP test.
Running mixed OLTP test
Doing read-only test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Maximum number of requests for OLTP test is limited to 10000
Threads started!
Done.

OLTP test statistics:
    queries performed:
        read:                            140224
        write:                           0
        other:                           20032
        total:                           160256
    transactions:                        10016  (19790.38 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 140224 (277065.34 per sec.)
    other operations:                    20032  (39580.76 per sec.)

Test execution summary:
    total time:                          0.5061s
    total number of events:              10016
    total time taken by event execution: 69.3937
    per-request statistics:
         min:                                  2.68ms
         avg:                                  6.93ms
         max:                                 18.74ms
         approx.  95 percentile:              10.18ms

Threads fairness:
    events (avg/stddev):           71.0355/10.40
    execution time (avg/stddev):   0.4922/0.00